
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>深入剖析K8S · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-theme-comscore/test.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../高并发系统设计/" />
    
    
    <link rel="prev" href="../kubernetes/k8s.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../设计模式/">
            
                <a href="../设计模式/">
            
                    
                    设计模式
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../设计模式/创建型/README.md">
            
                <span>
            
                    
                    创建型
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1.1" data-path="../设计模式/创建型/单例模式.html">
            
                <a href="../设计模式/创建型/单例模式.html">
            
                    
                    单例模式
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../消息队列/">
            
                <a href="../消息队列/">
            
                    
                    消息队列
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../消息队列/mq-1.html">
            
                <a href="../消息队列/mq-1.html">
            
                    
                    为什么需要消息队列
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../消息队列/mq-2.html">
            
                <a href="../消息队列/mq-2.html">
            
                    
                    该如何选择消息队列
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../消息队列/mq-3.html">
            
                <a href="../消息队列/mq-3.html">
            
                    
                    消息模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="../消息队列/mq-4.html">
            
                <a href="../消息队列/mq-4.html">
            
                    
                    如何利用事务消息实现分布式事务
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="../消息队列/mq-5.html">
            
                <a href="../消息队列/mq-5.html">
            
                    
                    如何确保消息不丢失
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.6" data-path="../消息队列/mq-6.html">
            
                <a href="../消息队列/mq-6.html">
            
                    
                    如何处理消费过程中消息重复消费
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.7" data-path="../消息队列/mq-7.html">
            
                <a href="../消息队列/mq-7.html">
            
                    
                    消息积压该如何处理
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../kubernetes/k8s.html">
            
                <a href="../kubernetes/k8s.html">
            
                    
                    Kubernetes
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.5" data-path="k8s.html">
            
                <a href="k8s.html">
            
                    
                    深入剖析K8S
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="../高并发系统设计/">
            
                <a href="../高并发系统设计/">
            
                    
                    高并发系统设计
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.6.1" data-path="../高并发系统设计/缓存/缓存.html">
            
                <a href="../高并发系统设计/缓存/缓存.html">
            
                    
                    缓存
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="../系统性能调优/1.html">
            
                <a href="../系统性能调优/1.html">
            
                    
                    系统性能调优
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >深入剖析K8S</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h4 id="&#x9694;&#x79BB;&#x4E0E;&#x9650;&#x5236;">&#x9694;&#x79BB;&#x4E0E;&#x9650;&#x5236;</h4>
<p>&#x57FA;&#x4E8E; Linux Namespace &#x7684;&#x9694;&#x79BB;&#x673A;&#x5236;&#x76F8;&#x6BD4;&#x4E8E;&#x865A;&#x62DF;&#x5316;&#x6280;&#x672F;&#x4E5F;&#x6709;&#x5F88;&#x591A;&#x4E0D;&#x8DB3;&#x4E4B;&#x5904;&#xFF0C;&#x5176;&#x4E2D;&#x6700;&#x4E3B;&#x8981;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x662F;&#xFF1A;&#x9694;&#x79BB;&#x5F97;&#x4E0D;&#x5F7B;&#x5E95;&#x3002;</p>
<ul>
<li>&#x9996;&#x5148;&#xFF0C;&#x65E2;&#x7136;&#x5BB9;&#x5668;&#x53EA;&#x662F;&#x8FD0;&#x884C;&#x5728;&#x5BBF;&#x4E3B;&#x673A;&#x4E0A;&#x7684;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x90A3;&#x4E48;&#x591A;&#x4E2A;&#x5BB9;&#x5668;&#x4E4B;&#x95F4;&#x4F7F;&#x7528;&#x7684;&#x5C31;&#x8FD8;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x5BBF;&#x4E3B;&#x673A;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5185;&#x6838;&#x3002;</li>
<li>&#x5176;&#x6B21;&#xFF0C;&#x5728; Linux &#x5185;&#x6838;&#x4E2D;&#xFF0C;&#x6709;&#x5F88;&#x591A;&#x8D44;&#x6E90;&#x548C;&#x5BF9;&#x8C61;&#x662F;&#x4E0D;&#x80FD;&#x88AB; Namespace &#x5316;&#x7684;&#xFF0C;&#x6700;&#x5178;&#x578B;&#x7684;&#x4F8B;&#x5B50;&#x5C31;&#x662F;&#xFF1A;&#x65F6;&#x95F4;&#x3002;<ul>
<li>&#x5C3D;&#x7BA1;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x6211;&#x4EEC;&#x786E;&#x5B9E;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; Seccomp &#x7B49;&#x6280;&#x672F;&#xFF0C;&#x5BF9;&#x5BB9;&#x5668;&#x5185;&#x90E8;&#x53D1;&#x8D77;&#x7684;&#x6240;&#x6709;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x8FDB;&#x884C;&#x8FC7;&#x6EE4;&#x548C;&#x7504;&#x522B;&#x6765;&#x8FDB;&#x884C;&#x5B89;&#x5168;&#x52A0;&#x56FA;&#xFF0C;&#x4F46;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x56E0;&#x4E3A;&#x591A;&#x4E86;&#x4E00;&#x5C42;&#x5BF9;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x7684;&#x8FC7;&#x6EE4;&#xFF0C;&#x4E00;&#x5B9A;&#x4F1A;&#x62D6;&#x7D2F;&#x5BB9;&#x5668;&#x7684;&#x6027;&#x80FD;&#x3002;&#x4F55;&#x51B5;&#xFF0C;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8C01;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x5230;&#x5E95;&#x8BE5;&#x5F00;&#x542F;&#x54EA;&#x4E9B;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#xFF0C;&#x7981;&#x6B62;&#x54EA;&#x4E9B;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x3002;</li>
</ul>
</li>
</ul>
<p>Linux Cgroups &#x5C31;&#x662F; Linux &#x5185;&#x6838;&#x4E2D;&#x7528;&#x6765;&#x4E3A;&#x8FDB;&#x7A0B;&#x8BBE;&#x7F6E;&#x8D44;&#x6E90;&#x9650;&#x5236;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x529F;&#x80FD;&#x3002;</p>
<p>Linux Cgroups &#x7684;&#x5168;&#x79F0;&#x662F; Linux Control Group&#x3002;&#x5B83;&#x6700;&#x4E3B;&#x8981;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x5C31;&#x662F;&#x9650;&#x5236;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x7EC4;&#x80FD;&#x591F;&#x4F7F;&#x7528;&#x7684;&#x8D44;&#x6E90;&#x4E0A;&#x9650;&#xFF0C;&#x5305;&#x62EC; CPU&#x3001;&#x5185;&#x5B58;&#x3001;&#x78C1;&#x76D8;&#x3001;&#x7F51;&#x7EDC;&#x5E26;&#x5BBD;&#x7B49;&#x7B49;&#x3002;</p>
<ul>
<li>&#x95EE;&#x9898;&#xFF1A;</li>
</ul>
<p>&#x4F17;&#x6240;&#x5468;&#x77E5;&#xFF0C;Linux &#x4E0B;&#x7684; /proc &#x76EE;&#x5F55;&#x5B58;&#x50A8;&#x7684;&#x662F;&#x8BB0;&#x5F55;&#x5F53;&#x524D;&#x5185;&#x6838;&#x8FD0;&#x884C;&#x72B6;&#x6001;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x7279;&#x6B8A;&#x6587;&#x4EF6;&#xFF0C;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8BBF;&#x95EE;&#x8FD9;&#x4E9B;&#x6587;&#x4EF6;&#xFF0C;&#x67E5;&#x770B;&#x7CFB;&#x7EDF;&#x4EE5;&#x53CA;&#x5F53;&#x524D;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x8FDB;&#x7A0B;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x6BD4;&#x5982; CPU &#x4F7F;&#x7528;&#x60C5;&#x51B5;&#x3001;&#x5185;&#x5B58;&#x5360;&#x7528;&#x7387;&#x7B49;&#xFF0C;&#x8FD9;&#x4E9B;&#x6587;&#x4EF6;&#x4E5F;&#x662F; top &#x6307;&#x4EE4;&#x67E5;&#x770B;&#x7CFB;&#x7EDF;&#x4FE1;&#x606F;&#x7684;&#x4E3B;&#x8981;&#x6570;&#x636E;&#x6765;&#x6E90;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4F60;&#x5982;&#x679C;&#x5728;&#x5BB9;&#x5668;&#x91CC;&#x6267;&#x884C; top &#x6307;&#x4EE4;&#xFF0C;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x5B83;&#x663E;&#x793A;&#x7684;&#x4FE1;&#x606F;&#x5C45;&#x7136;&#x662F;&#x5BBF;&#x4E3B;&#x673A;&#x7684; CPU &#x548C;&#x5185;&#x5B58;&#x6570;&#x636E;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5F53;&#x524D;&#x5BB9;&#x5668;&#x7684;&#x6570;&#x636E;&#x3002;&#x9020;&#x6210;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x539F;&#x56E0;&#x5C31;&#x662F;&#xFF0C;/proc &#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x5E76;&#x4E0D;&#x77E5;&#x9053;&#x7528;&#x6237;&#x901A;&#x8FC7; Cgroups &#x7ED9;&#x8FD9;&#x4E2A;&#x5BB9;&#x5668;&#x505A;&#x4E86;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x8D44;&#x6E90;&#x9650;&#x5236;&#xFF0C;&#x5373;&#xFF1A;/proc &#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E0D;&#x4E86;&#x89E3; Cgroups &#x9650;&#x5236;&#x7684;&#x5B58;&#x5728;&#x3002;</p>
<ul>
<li>&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#xFF1A;</li>
</ul>
<p>&#x628A;&#x5BBF;&#x4E3B;&#x673A;&#x7684; /var/lib/lxcfs/proc/memoinfo &#x6587;&#x4EF6;&#x6302;&#x8F7D;&#x5230;Docker&#x5BB9;&#x5668;&#x7684;/proc/meminfo&#x4F4D;&#x7F6E;&#x540E;&#x3002;&#x5BB9;&#x5668;&#x4E2D;&#x8FDB;&#x7A0B;&#x8BFB;&#x53D6;&#x76F8;&#x5E94;&#x6587;&#x4EF6;&#x5185;&#x5BB9;&#x65F6;&#xFF0C;LXCFS&#x7684;FUSE&#x5B9E;&#x73B0;&#x4F1A;&#x4ECE;&#x5BB9;&#x5668;&#x5BF9;&#x5E94;&#x7684;Cgroup&#x4E2D;&#x8BFB;&#x53D6;&#x6B63;&#x786E;&#x7684;&#x5185;&#x5B58;&#x9650;&#x5236;&#x3002;</p>
<h4 id="&#x5BB9;&#x5668;&#x955C;&#x50CF;">&#x5BB9;&#x5668;&#x955C;&#x50CF;</h4>
<p>&#x5BF9; Docker &#x9879;&#x76EE;&#x6765;&#x8BF4;&#xFF0C;&#x5B83;&#x6700;&#x6838;&#x5FC3;&#x7684;&#x539F;&#x7406;&#x5B9E;&#x9645;&#x4E0A;&#x5C31;&#x662F;&#x4E3A;&#x5F85;&#x521B;&#x5EFA;&#x7684;&#x7528;&#x6237;&#x8FDB;&#x7A0B;&#xFF1A;</p>
<ol>
<li>&#x542F;&#x7528; Linux Namespace &#x914D;&#x7F6E;&#xFF1B;</li>
<li>&#x8BBE;&#x7F6E;&#x6307;&#x5B9A;&#x7684; Cgroups &#x53C2;&#x6570;&#xFF1B;</li>
<li>&#x5207;&#x6362;&#x8FDB;&#x7A0B;&#x7684;&#x6839;&#x76EE;&#x5F55;&#xFF08;Change Root&#xFF09;&#x3002;</li>
</ol>
<ul>
<li><p>rootfs:&#x5B83;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x6240;&#x6709;&#x6587;&#x4EF6;&#x548C;&#x76EE;&#x5F55;&#xFF0C;&#x5E76;&#x4E0D;&#x5305;&#x542B;&#x5185;&#x6838;&#xFF0C;&#x6700;&#x591A;&#x4E5F;&#x5C31;&#x51E0;&#x767E;&#x5146;&#x3002;&#x800C;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x4F20;&#x7EDF;&#x865A;&#x62DF;&#x673A;&#x7684;&#x955C;&#x50CF;&#x5927;&#x591A;&#x662F;&#x4E00;&#x4E2A;&#x78C1;&#x76D8;&#x7684;&#x201C;&#x5FEB;&#x7167;&#x201D;&#xFF0C;&#x78C1;&#x76D8;&#x6709;&#x591A;&#x5927;&#xFF0C;&#x955C;&#x50CF;&#x5C31;&#x81F3;&#x5C11;&#x6709;&#x591A;&#x5927;&#x3002;</p>
</li>
<li><p>&#x901A;&#x8FC7;&#x7ED3;&#x5408;&#x4F7F;&#x7528; Mount Namespace &#x548C; rootfs&#xFF0C;&#x5BB9;&#x5668;&#x5C31;&#x80FD;&#x591F;&#x4E3A;&#x8FDB;&#x7A0B;&#x6784;&#x5EFA;&#x51FA;&#x4E00;&#x4E2A;&#x5B8C;&#x5584;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x9694;&#x79BB;&#x73AF;&#x5883;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x7684;&#x5B9E;&#x73B0;&#x8FD8;&#x5FC5;&#x987B;&#x611F;&#x8C22; chroot &#x548C; pivot_root &#x8FD9;&#x4E24;&#x4E2A;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x5207;&#x6362;&#x8FDB;&#x7A0B;&#x6839;&#x76EE;&#x5F55;&#x7684;&#x80FD;&#x529B;&#x3002;</p>
</li>
<li>&#x5728;&#x4E00;&#x4E2A;&#x6B63;&#x786E;&#x7684;&#x65F6;&#x673A;&#xFF0C;&#x8FDB;&#x884C;&#x4E00;&#x6B21;&#x7ED1;&#x5B9A;&#x6302;&#x8F7D;&#xFF0C;Docker &#x5C31;&#x53EF;&#x4EE5;&#x6210;&#x529F;&#x5730;&#x5C06;&#x4E00;&#x4E2A;&#x5BBF;&#x4E3B;&#x673A;&#x4E0A;&#x7684;&#x76EE;&#x5F55;&#x6216;&#x6587;&#x4EF6;&#xFF0C;&#x4E0D;&#x52A8;&#x58F0;&#x8272;&#x5730;&#x6302;&#x8F7D;&#x5230;&#x5BB9;&#x5668;&#x4E2D;&#x3002;</li>
</ul>
<p><img src="../images/image-20220307165808199.png" alt="image-20220307165808199"></p>
<h4 id="&#x4E3A;&#x4EC0;&#x4E48;&#x9700;&#x8981;pod">&#x4E3A;&#x4EC0;&#x4E48;&#x9700;&#x8981;POD</h4>
<p>k8S&#x6BD4;&#x4F5C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x8BDD;&#xFF0C;&#x5BB9;&#x5668;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x4E2A;&#x8FDB;&#x7A0B;&#xFF0C;pod&#x5C31;&#x662F;&#x865A;&#x62DF;&#x673A;</p>
<ul>
<li><p>Pod&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x5728;&#x626E;&#x6F14;&#x4F20;&#x7EDF;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x91CC;&#x201C;&#x865A;&#x62DF;&#x673A;&#x201D;&#x7684;&#x89D2;&#x8272;&#xFF1B;&#x800C;&#x5BB9;&#x5668;&#xFF0C;&#x5219;&#x662F;&#x8FD9;&#x4E2A;&#x865A;&#x62DF;&#x673A;&#x91CC;&#x8FD0;&#x884C;&#x7684;&#x7528;&#x6237;&#x7A0B;&#x5E8F;&#x3002;</p>
</li>
<li><p>Pod &#x6700;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x4E2A;&#x4E8B;&#x5B9E;&#x662F;&#xFF1A;&#x5B83;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x903B;&#x8F91;&#x6982;&#x5FF5;&#x3002;</p>
</li>
<li>Pod &#x91CC;&#x7684;&#x6240;&#x6709;&#x5BB9;&#x5668;&#xFF0C;&#x5171;&#x4EAB;&#x7684;&#x662F;&#x540C;&#x4E00;&#x4E2A; Network Namespace&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x58F0;&#x660E;&#x5171;&#x4EAB;&#x540C;&#x4E00;&#x4E2A; Volume&#x3002;</li>
</ul>
<h4 id="&#x6DF1;&#x5165;&#x89E3;&#x6790;pod">&#x6DF1;&#x5165;&#x89E3;&#x6790;pod</h4>
<ul>
<li>&#x51E1;&#x662F;&#x8C03;&#x5EA6;&#x3001;&#x7F51;&#x7EDC;&#x3001;&#x5B58;&#x50A8;&#xFF0C;&#x4EE5;&#x53CA;&#x5B89;&#x5168;&#x76F8;&#x5173;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x662F; Pod &#x7EA7;&#x522B;&#x7684;&#x3002;</li>
</ul>
<h4 id="&#x63A7;&#x5236;&#x5668;&#x6A21;&#x578B;">&#x63A7;&#x5236;&#x5668;&#x6A21;&#x578B;</h4>
<ul>
<li>Deployment &#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x4E00;&#x4E2A;&#x4E24;&#x5C42;&#x63A7;&#x5236;&#x5668;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x5B83;&#x901A;&#x8FC7;ReplicaSet &#x7684;&#x4E2A;&#x6570;&#x6765;&#x63CF;&#x8FF0;&#x5E94;&#x7528;&#x7684;&#x7248;&#x672C;&#xFF1B;&#x7136;&#x540E;&#xFF0C;&#x5B83;&#x518D;&#x901A;&#x8FC7;ReplicaSet &#x7684;&#x5C5E;&#x6027;&#xFF08;&#x6BD4;&#x5982; replicas&#x7684;&#x503C;&#xFF09;&#xFF0C;&#x6765;&#x4FDD;&#x8BC1; Pod &#x7684;&#x526F;&#x672C;&#x6570;&#x91CF;&#x3002;</li>
</ul>
<ul>
<li><p>StatefulSet &#x7684;&#x8BBE;&#x8BA1;&#x5176;&#x5B9E;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x3002;&#x5B83;&#x628A;&#x771F;&#x5B9E;&#x4E16;&#x754C;&#x91CC;&#x7684;&#x5E94;&#x7528;&#x72B6;&#x6001;&#xFF0C;&#x62BD;&#x8C61;&#x4E3A;&#x4E86;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#xFF1A;</p>
<p>1.&#x62D3;&#x6251;&#x72B6;&#x6001;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x5E94;&#x7528;&#x7684;&#x591A;&#x4E2A;&#x5B9E;&#x4F8B;&#x4E4B;&#x95F4;&#x4E0D;&#x662F;&#x5B8C;&#x5168;&#x5BF9;&#x7B49;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x8FD9;&#x4E9B;&#x5E94;&#x7528;&#x5B9E;&#x4F8B;&#xFF0C;&#x5FC5;&#x987B;&#x6309;&#x7167;&#x67D0;&#x4E9B;&#x987A;&#x5E8F;&#x542F;&#x52A8;&#xFF0C;&#x6BD4;&#x5982;&#x5E94;&#x7528;&#x7684;&#x4E3B;&#x8282;&#x70B9; A &#x8981;&#x5148;&#x4E8E;&#x4ECE;&#x8282;&#x70B9; B &#x542F;&#x52A8;&#x3002;&#x800C;&#x5982;&#x679C;&#x4F60;&#x628A; A&#x548C; B &#x4E24;&#x4E2A; Pod &#x5220;&#x9664;&#x6389;&#xFF0C;&#x5B83;&#x4EEC;&#x518D;&#x6B21;&#x88AB;&#x521B;&#x5EFA;&#x51FA;&#x6765;&#x65F6;&#x4E5F;&#x5FC5;&#x987B;&#x4E25;&#x683C;&#x6309;&#x7167;&#x8FD9;&#x4E2A;&#x987A;&#x5E8F;&#x624D;&#x884C;&#x3002;&#x5E76;&#x4E14;&#xFF0C;&#x65B0;&#x521B;&#x5EFA;&#x51FA;&#x6765;&#x7684; Pod&#xFF0C;&#x5FC5;&#x987B;&#x548C;&#x539F;&#x6765; Pod &#x7684;&#x7F51;&#x7EDC;&#x6807;&#x8BC6;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x6837;&#x539F;&#x5148;&#x7684;&#x8BBF;&#x95EE;&#x8005;&#x624D;&#x80FD;&#x4F7F;&#x7528;&#x540C;&#x6837;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8BBF;&#x95EE;&#x5230;&#x8FD9;&#x4E2A;&#x65B0; Pod&#x3002;</p>
<p>2.&#x5B58;&#x50A8;&#x72B6;&#x6001;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x5E94;&#x7528;&#x7684;&#x591A;&#x4E2A;&#x5B9E;&#x4F8B;&#x5206;&#x522B;&#x7ED1;&#x5B9A;&#x4E86;&#x4E0D;&#x540C;&#x7684;&#x5B58;&#x50A8;&#x6570;&#x636E;&#x3002;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E9B;&#x5E94;&#x7528;&#x5B9E;&#x4F8B;&#x6765;&#x8BF4;&#xFF0C;Pod A &#x7B2C;&#x4E00;&#x6B21;&#x8BFB;&#x53D6;&#x5230;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x548C;&#x9694;&#x4E86;&#x5341;&#x5206;&#x949F;&#x4E4B;&#x540E;&#x518D;&#x6B21;&#x8BFB;&#x53D6;&#x5230;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5E94;&#x8BE5;&#x662F;&#x540C;&#x4E00;&#x4EFD;&#xFF0C;&#x54EA;&#x6015;&#x5728;&#x6B64;&#x671F;&#x95F4; Pod A &#x88AB;&#x91CD;&#x65B0;&#x521B;&#x5EFA;&#x8FC7;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x6700;&#x5178;&#x578B;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x5E94;&#x7528;&#x7684;&#x591A;&#x4E2A;&#x5B58;&#x50A8;&#x5B9E;&#x4F8B;&#x3002;&#x6240;&#x4EE5;&#xFF0C;StatefulSet &#x7684;&#x6838;&#x5FC3;&#x529F;&#x80FD;&#xFF0C;&#x5C31;&#x662F;&#x901A;&#x8FC7;&#x67D0;&#x79CD;&#x65B9;&#x5F0F;&#x8BB0;&#x5F55;&#x8FD9;&#x4E9B;&#x72B6;&#x6001;&#xFF0C;&#x7136;&#x540E;&#x5728; Pod &#x88AB;&#x91CD;&#x65B0;&#x521B;&#x5EFA;&#x65F6;&#xFF0C;&#x80FD;&#x591F;&#x4E3A;&#x65B0; Pod &#x6062;&#x590D;&#x8FD9;&#x4E9B;&#x72B6;&#x6001;&#x3002;</p>
</li>
</ul>
<ul>
<li>Headless Service &#x4E0D;&#x9700;&#x8981;&#x5206;&#x914D;&#x4E00;&#x4E2A; VIP&#xFF0C;&#x800C;&#x662F;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x4EE5; DNS &#x8BB0;&#x5F55;&#x7684;&#x65B9;&#x5F0F;&#x89E3;&#x6790;&#x51FA;&#x88AB;&#x4EE3;&#x7406; Pod &#x7684; IP &#x5730;&#x5740;&#x3002;</li>
<li>StatefulSet &#x8FD9;&#x4E2A;&#x63A7;&#x5236;&#x5668;&#x7684;&#x4E3B;&#x8981;&#x4F5C;&#x7528;&#x4E4B;&#x4E00;&#xFF0C;&#x5C31;&#x662F;&#x4F7F;&#x7528; Pod &#x6A21;&#x677F;&#x521B;&#x5EFA; Pod &#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5BF9;&#x5B83;&#x4EEC;&#x8FDB;&#x884C;&#x7F16;&#x53F7;&#xFF0C;&#x5E76;&#x4E14;&#x6309;&#x7167;&#x7F16;&#x53F7;&#x987A;&#x5E8F;&#x9010;&#x4E00;&#x5B8C;&#x6210;&#x521B;&#x5EFA;&#x5DE5;&#x4F5C;&#x3002;&#x800C;&#x5F53;StatefulSet &#x7684;&#x201C;&#x63A7;&#x5236;&#x5FAA;&#x73AF;&#x201D;&#x53D1;&#x73B0; Pod &#x7684;&#x201C;&#x5B9E;&#x9645;&#x72B6;&#x6001;&#x201D;&#x4E0E;&#x201C;&#x671F;&#x671B;&#x72B6;&#x6001;&#x201D;&#x4E0D;&#x4E00;&#x81F4;&#xFF0C;&#x9700;&#x8981;&#x65B0;&#x5EFA;&#x6216;&#x8005;&#x5220;&#x9664; Pod &#x8FDB;&#x884C;&#x201C;&#x8C03;&#x8C10;&#x201D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x4F1A;&#x4E25;&#x683C;&#x6309;&#x7167;&#x8FD9;&#x4E9B; Pod&#x7F16;&#x53F7;&#x7684;&#x987A;&#x5E8F;&#xFF0C;&#x9010;&#x4E00;&#x5B8C;&#x6210;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#x3002;</li>
</ul>
<h4 id="&#x58F0;&#x660E;&#x5F0F;api">&#x58F0;&#x660E;&#x5F0F;API</h4>
<ul>
<li>&#x9996;&#x5148;&#xFF0C;&#x6240;&#x8C13;&#x201C;&#x58F0;&#x660E;&#x5F0F;&#x201D;&#xFF0C;&#x6307;&#x7684;&#x5C31;&#x662F;&#x6211;&#x53EA;&#x9700;&#x8981;&#x63D0;&#x4EA4;&#x4E00;&#x4E2A;&#x5B9A;&#x4E49;&#x597D;&#x7684; API &#x5BF9;&#x8C61;&#x6765;&#x201C;&#x58F0;&#x660E;&#x201D;&#xFF0C;&#x6211;&#x6240;&#x671F;&#x671B;&#x7684;&#x72B6;&#x6001;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#x3002;</li>
<li>&#x5176;&#x6B21;&#xFF0C;&#x201C;&#x58F0;&#x660E;&#x5F0F; API&#x201D;&#x5141;&#x8BB8;&#x6709;&#x591A;&#x4E2A; API &#x5199;&#x7AEF;&#xFF0C;&#x4EE5; PATCH &#x7684;&#x65B9;&#x5F0F;&#x5BF9; API &#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x5173;&#x5FC3;&#x672C;&#x5730;&#x539F;&#x59CB; YAML &#x6587;&#x4EF6;&#x7684;&#x5185;&#x5BB9;&#x3002;</li>
<li>&#x6700;&#x540E;&#xFF0C;&#x4E5F;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x6709;&#x4E86;&#x4E0A;&#x8FF0;&#x4E24;&#x4E2A;&#x80FD;&#x529B;&#xFF0C;Kubernetes &#x9879;&#x76EE;&#x624D;&#x53EF;&#x4EE5;&#x57FA;&#x4E8E;&#x5BF9; API &#x5BF9;&#x8C61;&#x7684;&#x589E;&#x3001;&#x5220;&#x3001;&#x6539;&#x3001;&#x67E5;&#xFF0C;&#x5728;&#x5B8C;&#x5168;&#x65E0;&#x9700;&#x5916;&#x754C;&#x5E72;&#x9884;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B8C;&#x6210;&#x5BF9;&#x201C;&#x5B9E;&#x9645;&#x72B6;&#x6001;&#x201D;&#x548C;&#x201C;&#x671F;&#x671B;&#x72B6;&#x6001;&#x201D;&#x7684;&#x8C03;&#x8C10;&#xFF08;Reconcile&#xFF09;&#x8FC7;&#x7A0B;&#x3002;</li>
</ul>
<h5 id="dynamic-admission-controller">Dynamic Admission Controller</h5>
<p>k8s initializer&#x7684;&#x539F;&#x7406;&#xFF0C;&#x5728;pod&#x7684;metadata&#x4E2D;&#x6DFB;&#x52A0;initializers  pedding&#x5B57;&#x6BB5;&#xFF0C;&#x8FDB;&#x5165;Admission Controller&#x5904;&#x7406;&#x5B8C;&#x6210;&#x540E;&#x5C06;&#x5B57;&#x6BB5;&#x5220;&#x9664;</p>
<p>&#x4E00;&#x4E2A; API &#x5BF9;&#x8C61;&#x5728; Etcd &#x91CC;&#x7684;&#x5B8C;&#x6574;&#x8D44;&#x6E90;&#x8DEF;&#x5F84;&#xFF0C;&#x662F;&#x7531;&#xFF1A;Gro</p>
<h4 id="&#x81EA;&#x5B9A;&#x4E49;&#x63A7;&#x5236;&#x5668;">&#x81EA;&#x5B9A;&#x4E49;&#x63A7;&#x5236;&#x5668;</h4>
<p><img src="../images/image-20220309113651616.png" alt="image-20220309113651616"></p>
<ul>
<li>&#x6240;&#x8C13; Informer&#xFF0C;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5E26;&#x6709;&#x672C;&#x5730;&#x7F13;&#x5B58;&#x548C;&#x7D22;&#x5F15;&#x673A;&#x5236;&#x7684;&#x3001;&#x53EF;&#x4EE5;&#x6CE8;&#x518C; EventHandler &#x7684; client&#x3002;&#x5B83;&#x662F;&#x81EA;&#x5B9A;&#x4E49;&#x63A7;&#x5236;&#x5668;&#x8DDF; APIServer &#x8FDB;&#x884C;&#x6570;&#x636E;&#x540C;&#x6B65;&#x7684;&#x91CD;&#x8981;&#x7EC4;&#x4EF6;&#x3002;</li>
<li>Informer &#x901A;&#x8FC7;&#x4E00;&#x79CD;&#x53EB;&#x4F5C; ListAndWatch &#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x628A; APIServer &#x4E2D;&#x7684; API &#x5BF9;&#x8C61;&#x7F13;&#x5B58;&#x5728;&#x4E86;&#x672C;&#x5730;&#xFF0C;&#x5E76;&#x8D1F;&#x8D23;&#x66F4;&#x65B0;&#x548C;&#x7EF4;&#x62A4;&#x8FD9;&#x4E2A;&#x7F13;&#x5B58;&#x3002;</li>
</ul>
<h4 id="pvpvcstorageclass">PV,PVC,StorageClass</h4>
<p><img src="../images/image-20220309182519200.png" alt="image-20220309182519200"></p>
<ul>
<li><p>PVC &#x63CF;&#x8FF0;&#x7684;&#xFF0C;&#x662F; Pod &#x60F3;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x6301;&#x4E45;&#x5316;&#x5B58;&#x50A8;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x6BD4;&#x5982;&#x5B58;&#x50A8;&#x7684;&#x5927;&#x5C0F;&#x3001;&#x8BFB;&#x5199;&#x6743;&#x9650;&#x7B49;&#x3002;</p>
</li>
<li><p>PV &#x63CF;&#x8FF0;&#x7684;&#xFF0C;&#x5219;&#x662F;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x7684; Volume &#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x6BD4;&#x5982; Volume &#x7684;&#x7C7B;&#x578B;&#x3001;&#x6302;&#x8F7D;&#x76EE;&#x5F55;&#x3001;&#x8FDC;&#x7A0B;&#x5B58;&#x50A8;&#x670D;&#x52A1;&#x5668;&#x5730;&#x5740;&#x7B49;&#x3002;</p>
</li>
<li><p>&#x800C; StorageClass &#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x5219;&#x662F;&#x5145;&#x5F53; PV &#x7684;&#x6A21;&#x677F;&#x3002;&#x5E76;&#x4E14;&#xFF0C;&#x53EA;&#x6709;&#x540C;&#x5C5E;&#x4E8E;&#x4E00;&#x4E2A; StorageClass&#x7684; PV &#x548C; PVC&#xFF0C;&#x624D;&#x53EF;&#x4EE5;&#x7ED1;&#x5B9A;&#x5728;&#x4E00;&#x8D77;&#x3002;</p>
</li>
</ul>
<h4 id="csi">CSI</h4>
<p><img src="../images/image-20220309190057725.png" alt="image-20220309190057725"></p>
<h4 id="cni">CNI</h4>
<h5 id="fannel&#x539F;&#x7406;">Fannel&#x539F;&#x7406;</h5>
<p><img src="../images/image-20220310111118563.png" alt="image-20220310111118563"></p>
<blockquote>
<p>host-gw</p>
</blockquote>
<p><img src="../images/image-20220310112646404.png" alt="image-20220310112646404"></p>
<h5 id="calico">calico</h5>
<ul>
<li>BGP &#x7684;&#x5168;&#x79F0;&#x662F; Border Gateway Protocol&#xFF0C;&#x5373;&#xFF1A;&#x8FB9;&#x754C;&#x7F51;&#x5173;&#x534F;&#x8BAE;&#x3002;&#x5B83;&#x662F;&#x4E00;&#x4E2A; Linux &#x5185;&#x6838;&#x539F;&#x751F;&#x5C31;&#x652F;&#x6301;&#x7684;&#x3001;&#x4E13;&#x95E8;&#x7528;&#x5728;&#x5927;&#x89C4;&#x6A21;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x91CC;&#x7EF4;&#x62A4;&#x4E0D;&#x540C;&#x7684;&#x201C;&#x81EA;&#x6CBB;&#x7CFB;&#x7EDF;&#x201D;&#x4E4B;&#x95F4;&#x8DEF;&#x7531;&#x4FE1;&#x606F;&#x7684;&#x3001;&#x65E0;&#x4E2D;&#x5FC3;&#x7684;&#x8DEF;&#x7531;&#x534F;&#x8BAE;&#x3002;</li>
<li>&#x6240;&#x8C13; BGP&#xFF0C;&#x5C31;&#x662F;&#x5728;&#x5927;&#x89C4;&#x6A21;&#x7F51;&#x7EDC;&#x4E2D;&#x5B9E;&#x73B0;&#x8282;&#x70B9;&#x8DEF;&#x7531;&#x4FE1;&#x606F;&#x5171;&#x4EAB;&#x7684;&#x4E00;&#x79CD;&#x534F;&#x8BAE;&#x3002;&#x800C; BGP &#x7684;&#x8FD9;&#x4E2A;&#x80FD;&#x529B;&#xFF0C;&#x6B63;&#x597D;&#x53EF;&#x4EE5;&#x53D6;&#x4EE3; Flannel &#x7EF4;&#x62A4;&#x4E3B;&#x673A;&#x4E0A;&#x8DEF;&#x7531;&#x8868;&#x7684;&#x529F;&#x80FD;&#x3002;&#x800C;&#x4E14;&#xFF0C;BGP &#x8FD9;&#x79CD;&#x539F;&#x751F;&#x5C31;&#x662F;&#x4E3A;&#x5927;&#x89C4;&#x6A21;&#x7F51;&#x7EDC;&#x73AF;&#x5883;&#x800C;&#x5B9E;&#x73B0;&#x7684;&#x534F;&#x8BAE;&#xFF0C;&#x5176;&#x53EF;&#x9760;&#x6027;&#x548C;&#x53EF;&#x6269;&#x5C55;&#x6027;&#xFF0C;&#x8FDC;&#x975E; Flannel &#x81EA;&#x5DF1;&#x7684;&#x65B9;&#x6848;&#x53EF;&#x6BD4;&#x3002;</li>
</ul>
<p><img src="../images/image-20220310114114815.png" alt="image-20220310114114815"></p>
<p>Calico &#x9879;&#x76EE;&#x7684;&#x67B6;&#x6784;&#x5C31;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x4E86;&#x3002;&#x5B83;&#x7531;&#x4E09;&#x4E2A;&#x90E8;&#x5206;&#x7EC4;&#x6210;&#xFF1A;</p>
<ol>
<li>Calico &#x7684; CNI &#x63D2;&#x4EF6;&#x3002;&#x8FD9;&#x662F; Calico &#x4E0E; Kubernetes &#x5BF9;&#x63A5;&#x7684;&#x90E8;&#x5206;&#x3002;</li>
<li>Felix&#x3002;&#x5B83;&#x662F;&#x4E00;&#x4E2A; DaemonSet&#xFF0C;&#x8D1F;&#x8D23;&#x5728;&#x5BBF;&#x4E3B;&#x673A;&#x4E0A;&#x63D2;&#x5165;&#x8DEF;&#x7531;&#x89C4;&#x5219;&#xFF08;&#x5373;&#xFF1A;&#x5199;&#x5165; Linux &#x5185;&#x6838;&#x7684;FIB &#x8F6C;&#x53D1;&#x4FE1;&#x606F;&#x5E93;&#xFF09;&#xFF0C;&#x4EE5;&#x53CA;&#x7EF4;&#x62A4; Calico &#x6240;&#x9700;&#x7684;&#x7F51;&#x7EDC;&#x8BBE;&#x5907;&#x7B49;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>BIRD&#x3002;&#x5B83;&#x5C31;&#x662F; BGP &#x7684;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x4E13;&#x95E8;&#x8D1F;&#x8D23;&#x5728;&#x96C6;&#x7FA4;&#x91CC;&#x5206;&#x53D1;&#x8DEF;&#x7531;&#x89C4;&#x5219;&#x4FE1;&#x606F;&#x3002;</li>
</ol>
<ul>
<li>Calico &#x7EF4;&#x62A4;&#x7684;&#x7F51;&#x7EDC;&#x5728;&#x9ED8;&#x8BA4;&#x914D;&#x7F6E;&#x4E0B;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x88AB;&#x79F0;&#x4E3A;&#x201C;Node-to-Node Mesh&#x201D;&#x7684;&#x6A21;&#x5F0F;&#x3002;&#x8FD9;&#x65F6;&#x5019;&#xFF0C;&#x6BCF;&#x53F0;&#x5BBF;&#x4E3B;&#x673A;&#x4E0A;&#x7684; BGP Client &#x90FD;&#x9700;&#x8981;&#x8DDF;&#x5176;&#x4ED6;&#x6240;&#x6709;&#x8282;&#x70B9;&#x7684; BGPClient &#x8FDB;&#x884C;&#x901A;&#x4FE1;&#x4EE5;&#x4FBF;&#x4EA4;&#x6362;&#x8DEF;&#x7531;&#x4FE1;&#x606F;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x968F;&#x7740;&#x8282;&#x70B9;&#x6570;&#x91CF; N &#x7684;&#x589E;&#x52A0;&#xFF0C;&#x8FD9;&#x4E9B;&#x8FDE;&#x63A5;&#x7684;&#x6570;&#x91CF;&#x5C31;&#x4F1A;&#x4EE5; N&#xB2;&#x7684;&#x89C4;&#x6A21;&#x5FEB;&#x901F;&#x589E;&#x957F;&#xFF0C;&#x4ECE;&#x800C;&#x7ED9;&#x96C6;&#x7FA4;&#x672C;&#x8EAB;&#x7684;&#x7F51;&#x7EDC;&#x5E26;&#x6765;&#x5DE8;&#x5927;&#x7684;&#x538B;&#x529B;&#x3002;&#x6240;&#x4EE5;&#xFF0C;Node-to-Node Mesh &#x6A21;&#x5F0F;&#x4E00;&#x822C;&#x63A8;&#x8350;&#x7528;&#x5728;&#x5C11;&#x4E8E; 100 &#x4E2A;&#x8282;&#x70B9;&#x7684;&#x96C6;&#x7FA4;&#x91CC;&#x3002;&#x800C;&#x5728;&#x66F4;&#x5927;&#x89C4;&#x6A21;&#x7684;&#x96C6;&#x7FA4;&#x4E2D;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x7528;&#x5230;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x53EB;&#x4F5C; Route Reflector &#x7684;&#x6A21;&#x5F0F;&#x3002;</li>
</ul>
<h4 id="networkpolicy">Networkpolicy</h4>
<ul>
<li>Kubernetes &#x7F51;&#x7EDC;&#x63D2;&#x4EF6;&#x5BF9; Pod &#x8FDB;&#x884C;&#x9694;&#x79BB;&#xFF0C;&#x5176;&#x5B9E;&#x662F;&#x9760;&#x5728;&#x5BBF;&#x4E3B;&#x673A;&#x4E0A;&#x751F;&#x6210;NetworkPolicy &#x5BF9;&#x5E94;&#x7684; iptable &#x89C4;&#x5219;&#x6765;&#x5B9E;&#x73B0;&#x7684;&#x3002;</li>
</ul>
<h4 id="servicedns">Service/DNS</h4>
<ul>
<li>kube-proxy &#x901A;&#x8FC7; iptables &#x5904;&#x7406; Service &#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5176;&#x5B9E;&#x9700;&#x8981;&#x5728;&#x5BBF;&#x4E3B;&#x673A;&#x4E0A;&#x8BBE;&#x7F6E;&#x76F8;&#x5F53;&#x591A;&#x7684; iptables &#x89C4;&#x5219;&#x3002;&#x800C;&#x4E14;&#xFF0C;kube-proxy &#x8FD8;&#x9700;&#x8981;&#x5728;&#x63A7;&#x5236;&#x5FAA;&#x73AF;&#x91CC;&#x4E0D;&#x65AD;&#x5730;&#x5237;&#x65B0;&#x8FD9;&#x4E9B;&#x89C4;&#x5219;&#x6765;&#x786E;&#x4FDD;&#x5B83;&#x4EEC;&#x59CB;&#x7EC8;&#x662F;&#x6B63;&#x786E;&#x7684;&#x3002;</li>
<li>IPVS &#x5728;&#x5185;&#x6838;&#x4E2D;&#x7684;&#x5B9E;&#x73B0;&#x5176;&#x5B9E;&#x4E5F;&#x662F;&#x57FA;&#x4E8E; Netfilter &#x7684; NAT &#x6A21;&#x5F0F;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x8F6C;&#x53D1;&#x8FD9;&#x4E00;&#x5C42;&#x4E0A;&#xFF0C;&#x7406;&#x8BBA;&#x4E0A; IPVS &#x5E76;&#x6CA1;&#x6709;&#x663E;&#x8457;&#x7684;&#x6027;&#x80FD;&#x63D0;&#x5347;&#x3002;&#x4F46;&#x662F;&#xFF0C;IPVS &#x5E76;&#x4E0D;&#x9700;&#x8981;&#x5728;&#x5BBF;&#x4E3B;&#x673A;&#x4E0A;&#x4E3A;&#x6BCF;&#x4E2A; Pod &#x8BBE;&#x7F6E; iptables &#x89C4;&#x5219;,&#x800C;&#x662F;&#x628A;&#x5BF9;&#x8FD9;&#x4E9B;&#x201C;&#x89C4;&#x5219;&#x201D;&#x7684;&#x5904;&#x7406;&#x653E;&#x5230;&#x4E86;&#x5185;&#x6838;&#x6001;&#xFF0C;&#x4ECE;&#x800C;&#x6781;&#x5927;&#x5730;&#x964D;&#x4F4E;&#x4E86;&#x7EF4;&#x62A4;&#x8FD9;&#x4E9B;&#x89C4;&#x5219;&#x7684;&#x4EE3;&#x4EF7;&#x3002;</li>
<li>IPVS &#x6A21;&#x5757;&#x53EA;&#x8D1F;&#x8D23;&#x4E0A;&#x8FF0;&#x7684;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x548C;&#x4EE3;&#x7406;&#x529F;&#x80FD;&#x3002;&#x800C;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684; Service&#x6D41;&#x7A0B;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x6240;&#x9700;&#x8981;&#x7684;&#x5305;&#x8FC7;&#x6EE4;&#x3001;SNAT &#x7B49;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD8;&#x662F;&#x8981;&#x9760; iptables &#x6765;&#x5B9E;&#x73B0;&#x3002;&#x53EA;&#x4E0D;&#x8FC7;&#xFF0C;&#x8FD9;&#x4E9B;&#x8F85;&#x52A9;&#x6027;&#x7684; iptables &#x89C4;&#x5219;&#x6570;&#x91CF;&#x6709;&#x9650;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x968F;&#x7740; Pod &#x6570;&#x91CF;&#x7684;&#x589E;&#x52A0;&#x800C;&#x589E;&#x52A0;&#x3002;</li>
<li>&#x6240;&#x8C13; Service&#xFF0C;&#x5176;&#x5B9E;&#x5C31;&#x662F; Kubernetes &#x4E3A; Pod &#x5206;&#x914D;&#x7684;&#x3001;&#x56FA;&#x5B9A;&#x7684;&#x3001;&#x57FA;&#x4E8E; iptables&#xFF08;&#x6216;&#x8005; IPVS&#xFF09;&#x7684;&#x8BBF;&#x95EE;&#x5165;&#x53E3;&#x3002;&#x800C;&#x8FD9;&#x4E9B;&#x8BBF;&#x95EE;&#x5165;&#x53E3;&#x4EE3;&#x7406;&#x7684; Pod &#x4FE1;&#x606F;&#xFF0C;&#x5219;&#x6765;&#x81EA;&#x4E8E;Etcd&#xFF0C;&#x7531; kube-proxy &#x901A;&#x8FC7;&#x63A7;&#x5236;&#x5FAA;&#x73AF;&#x6765;&#x7EF4;&#x62A4;&#x3002;</li>
</ul>
<h4 id="&#x8C03;&#x5EA6;&#x5668;">&#x8C03;&#x5EA6;&#x5668;</h4>
<ol>
<li>&#x4ECE;&#x96C6;&#x7FA4;&#x6240;&#x6709;&#x7684;&#x8282;&#x70B9;&#x4E2D;&#xFF0C;&#x6839;&#x636E;&#x8C03;&#x5EA6;&#x7B97;&#x6CD5;&#x6311;&#x9009;&#x51FA;&#x6240;&#x6709;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x8BE5; Pod &#x7684;&#x8282;&#x70B9;&#xFF1B;</li>
<li>&#x4ECE;&#x7B2C;&#x4E00;&#x6B65;&#x7684;&#x7ED3;&#x679C;&#x4E2D;&#xFF0C;&#x518D;&#x6839;&#x636E;&#x8C03;&#x5EA6;&#x7B97;&#x6CD5;&#x6311;&#x9009;&#x4E00;&#x4E2A;&#x6700;&#x7B26;&#x5408;&#x6761;&#x4EF6;&#x7684;&#x8282;&#x70B9;&#x4F5C;&#x4E3A;&#x6700;&#x7EC8;&#x7ED3;&#x679C;&#x3002;</li>
</ol>
<p>&#x9ED8;&#x8BA4;&#x8C03;&#x5EA6;&#x5668;&#x4F1A;&#x9996;&#x5148;&#x8C03;&#x7528;&#x4E00;&#x7EC4;&#x53EB;&#x4F5C; Predicate &#x7684;&#x8C03;&#x5EA6;&#x7B97;&#x6CD5;&#xFF0C;&#x6765;&#x68C0;&#x67E5;&#x6BCF;&#x4E2A; Node&#x3002;&#x7136;&#x540E;&#xFF0C;&#x518D;&#x8C03;&#x7528;&#x4E00;&#x7EC4;&#x53EB;&#x4F5C; Priority &#x7684;&#x8C03;&#x5EA6;&#x7B97;&#x6CD5;&#xFF0C;&#x6765;&#x7ED9;&#x4E0A;&#x4E00;&#x6B65;&#x5F97;&#x5230;&#x7684;&#x7ED3;&#x679C;&#x91CC;&#x7684;&#x6BCF;&#x4E2A; Node &#x6253;&#x5206;&#x3002;&#x6700;&#x7EC8;&#x7684;&#x8C03;&#x5EA6;&#x7ED3;&#x679C;&#xFF0C;&#x5C31;&#x662F;&#x5F97;&#x5206;&#x6700;&#x9AD8;&#x7684;&#x90A3;&#x4E2A; Node&#x3002;</p>
<p><img src="../images/image-20220310174936309.png" alt="image-20220310174936309"></p>
<h4 id="cri">CRI</h4>
<p><img src="../images/image-20220314165834922.png" alt="image-20220314165834922"></p>
<p>&#x5F53; Kubernetes &#x901A;&#x8FC7;&#x7F16;&#x6392;&#x80FD;&#x529B;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A; Pod &#x4E4B;&#x540E;&#xFF0C;&#x8C03;&#x5EA6;&#x5668;&#x4F1A;&#x4E3A;&#x8FD9;&#x4E2A; Pod &#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x7684;&#x8282;&#x70B9;&#x6765;&#x8FD0;&#x884C;&#x3002;&#x8FD9;&#x65F6;&#x5019;&#xFF0C;kubelet &#x5F53;&#x7136;&#x5C31;&#x4F1A;&#x901A;&#x8FC7;&#x524D;&#x9762;&#x8BB2;&#x89E3;&#x8FC7;&#x7684; SyncLoop &#x6765;&#x5224;&#x65AD;&#x9700;&#x8981;&#x6267;&#x884C;&#x7684;&#x5177;&#x4F53;&#x64CD;&#x4F5C;&#xFF0C;&#x6BD4;&#x5982;&#x521B;&#x5EFA;&#x4E00;&#x4E2A; Pod&#x3002;&#x90A3;&#x4E48;&#x6B64;&#x65F6;&#xFF0C;kubelet &#x5B9E;&#x9645;&#x4E0A;&#x5C31;&#x4F1A;&#x8C03;&#x7528;&#x4E00;&#x4E2A;&#x53EB;&#x4F5C;GenericRuntime &#x7684;&#x901A;&#x7528;&#x7EC4;&#x4EF6;&#x6765;&#x53D1;&#x8D77;&#x521B;&#x5EFA; Pod &#x7684; CRI &#x8BF7;&#x6C42;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;&#x7684;&#x5BB9;&#x5668;&#x9879;&#x76EE;&#x662F; Docker &#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x8D1F;&#x8D23;&#x54CD;&#x5E94;&#x8FD9;&#x4E2A;&#x8BF7;&#x6C42;&#x7684;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x53EB;&#x4F5C;dockershim &#x7684;&#x7EC4;&#x4EF6;&#x3002;&#x5B83;&#x4F1A;&#x628A; CRI &#x8BF7;&#x6C42;&#x91CC;&#x7684;&#x5185;&#x5BB9;&#x62FF;&#x51FA;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x7EC4;&#x88C5;&#x6210; Docker API &#x8BF7;&#x6C42;&#x53D1;&#x7ED9;Docker Daemon&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../kubernetes/k8s.html" class="navigation navigation-prev " aria-label="Previous page: Kubernetes">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../高并发系统设计/" class="navigation navigation-next " aria-label="Next page: 高并发系统设计">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"深入剖析K8S","level":"1.5","depth":1,"next":{"title":"高并发系统设计","level":"1.6","depth":1,"path":"高并发系统设计/README.md","ref":"高并发系统设计/README.md","articles":[{"title":"缓存","level":"1.6.1","depth":2,"path":"高并发系统设计/缓存/缓存.md","ref":"高并发系统设计/缓存/缓存.md","articles":[]}]},"previous":{"title":"Kubernetes","level":"1.4","depth":1,"path":"kubernetes/k8s.md","ref":"kubernetes/k8s.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["-lunr","-search","search-pro","back-to-top-button","expandable-chapters-small","page-toc-button","theme-comscore"],"pluginsConfig":{"search-pro":{},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"theme-comscore":{},"page-toc-button":{"maxTocDepth":2,"minTocSize":2},"back-to-top-button":{},"expandable-chapters-small":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"深入剖析k8s/k8s.md","mtime":"2022-04-02T02:39:29.015Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-04-03T13:34:32.078Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-theme-comscore/test.js"></script>
        
    

    </body>
</html>

