
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>DDD · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-theme-comscore/test.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="../系统性能调优/1.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../设计模式/">
            
                <a href="../设计模式/">
            
                    
                    设计模式
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../设计模式/创建型/README.md">
            
                <span>
            
                    
                    创建型
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1.1" data-path="../设计模式/创建型/单例模式.html">
            
                <a href="../设计模式/创建型/单例模式.html">
            
                    
                    单例模式
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../消息队列/">
            
                <a href="../消息队列/">
            
                    
                    消息队列
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../消息队列/mq-1.html">
            
                <a href="../消息队列/mq-1.html">
            
                    
                    为什么需要消息队列
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../消息队列/mq-2.html">
            
                <a href="../消息队列/mq-2.html">
            
                    
                    该如何选择消息队列
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../消息队列/mq-3.html">
            
                <a href="../消息队列/mq-3.html">
            
                    
                    消息模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="../消息队列/mq-4.html">
            
                <a href="../消息队列/mq-4.html">
            
                    
                    如何利用事务消息实现分布式事务
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="../消息队列/mq-5.html">
            
                <a href="../消息队列/mq-5.html">
            
                    
                    如何确保消息不丢失
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.6" data-path="../消息队列/mq-6.html">
            
                <a href="../消息队列/mq-6.html">
            
                    
                    如何处理消费过程中消息重复消费
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.7" data-path="../消息队列/mq-7.html">
            
                <a href="../消息队列/mq-7.html">
            
                    
                    消息积压该如何处理
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../kubernetes/k8s.html">
            
                <a href="../kubernetes/k8s.html">
            
                    
                    Kubernetes
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../深入剖析k8s/k8s.html">
            
                <a href="../深入剖析k8s/k8s.html">
            
                    
                    深入剖析K8S
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="../高并发系统设计/">
            
                <a href="../高并发系统设计/">
            
                    
                    高并发系统设计
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.6.1" data-path="../高并发系统设计/缓存/缓存.html">
            
                <a href="../高并发系统设计/缓存/缓存.html">
            
                    
                    缓存
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="../系统性能调优/1.html">
            
                <a href="../系统性能调优/1.html">
            
                    
                    系统性能调优
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.8" data-path="1.html">
            
                <a href="1.html">
            
                    
                    DDD
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >DDD</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x9886;&#x57DF;">&#x9886;&#x57DF;</h2>
<p>&#x200B;        &#x9886;&#x57DF;&#x7684;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x5C31;&#x662F;&#x5C06;&#x95EE;&#x9898;&#x57DF;&#x9010;&#x7EA7;&#x7EC6;&#x5206;&#xFF0C;&#x6765;&#x964D;&#x4F4E;&#x4E1A;&#x52A1;&#x7406;&#x89E3;&#x548C;&#x7CFB;&#x7EDF;&#x5B9E;&#x73B0;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x3002;&#x901A;&#x8FC7;&#x9886;&#x57DF;&#x7EC6;&#x5206;&#xFF0C;&#x9010;&#x6B65;&#x7F29;&#x5C0F;&#x5FAE;&#x670D;&#x52A1;&#x9700;&#x8981;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x57DF;&#xFF0C;&#x6784;&#x5EFA;&#x5408;&#x9002;&#x7684;&#x9886;&#x57DF;&#x6A21;&#x578B;&#xFF0C;&#x800C;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x6620;&#x5C04;&#x6210;&#x7CFB;&#x7EDF;&#x5C31;&#x662F;&#x5FAE;&#x670D;&#x52A1;&#x4E86;&#x3002;</p>
<ul>
<li>&#x9886;&#x57DF;&#xFF1A;DDD &#x7684;&#x9886;&#x57DF;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x8FB9;&#x754C;&#x5185;&#x8981;&#x89E3;&#x51B3;&#x7684;&#x4E1A;&#x52A1;&#x95EE;&#x9898;&#x57DF;&#x3002;</li>
<li>&#x5B50;&#x57DF;&#xFF1A;&#x9886;&#x57DF;&#x53EF;&#x4EE5;&#x8FDB;&#x4E00;&#x6B65;&#x5212;&#x5206;&#x4E3A;&#x5B50;&#x9886;&#x57DF;&#x3002;&#x6211;&#x4EEC;&#x628A;&#x5212;&#x5206;&#x51FA;&#x6765;&#x7684;&#x591A;&#x4E2A;&#x5B50;&#x9886;&#x57DF;&#x79F0;&#x4E3A;&#x5B50;&#x57DF;&#xFF0C;&#x6BCF;&#x4E2A;&#x5B50;&#x57DF;&#x5BF9;&#x5E94;&#x4E00;&#x4E2A;&#x66F4;&#x5C0F;&#x7684;&#x95EE;&#x9898;&#x57DF;&#x6216;&#x66F4;&#x5C0F;&#x7684;&#x4E1A;&#x52A1;&#x8303;&#x56F4;&#x3002;</li>
<li>&#x6838;&#x5FC3;&#x57DF;&#xFF1A;&#x51B3;&#x5B9A;&#x4EA7;&#x54C1;&#x548C;&#x516C;&#x53F8;&#x6838;&#x5FC3;&#x7ADE;&#x4E89;&#x529B;&#x7684;&#x5B50;&#x57DF;&#x662F;&#x6838;&#x5FC3;&#x57DF;</li>
<li>&#x901A;&#x7528;&#x57DF;&#xFF1A; &#x540C;&#x65F6;&#x88AB;&#x591A;&#x4E2A;&#x5B50;&#x57DF;&#x4F7F;&#x7528;&#x7684;&#x901A;&#x7528;&#x529F;&#x80FD;&#x5B50;&#x57DF;&#x662F;&#x901A;&#x7528;&#x57DF;&#x3002;</li>
<li>&#x652F;&#x6491;&#x57DF;&#xFF1A;&#x4E00;&#x79CD;&#x529F;&#x80FD;&#x5B50;&#x57DF;&#x662F;&#x5FC5;&#x9700;&#x7684;&#xFF0C;&#x4F46;&#x65E2;&#x4E0D;&#x5305;&#x542B;&#x51B3;&#x5B9A;&#x4EA7;&#x54C1;&#x548C;&#x516C;&#x53F8;&#x6838;&#x5FC3;&#x7ADE;&#x4E89;&#x529B;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x4E5F;&#x4E0D;&#x5305;&#x542B;&#x901A;&#x7528;&#x529F;&#x80FD;&#x7684;&#x5B50;&#x57DF;</li>
</ul>
<h3 id="&#x9886;&#x57DF;&#x8FB9;&#x754C;">&#x9886;&#x57DF;&#x8FB9;&#x754C;</h3>
<p>&#x200B;        &#x901A;&#x7528;&#x8BED;&#x8A00;&#x5B9A;&#x4E49;&#x4E0A;&#x4E0B;&#x6587;&#x542B;&#x4E49;&#xFF0C;&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x5219;&#x5B9A;&#x4E49;&#x9886;&#x57DF;&#x8FB9;&#x754C;&#xFF0C;</p>
<h4 id="&#x901A;&#x7528;&#x8BED;&#x8A00;">&#x901A;&#x7528;&#x8BED;&#x8A00;</h4>
<p>&#x200B;        &#x5728;&#x4E8B;&#x4EF6;&#x98CE;&#x66B4;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x901A;&#x8FC7;&#x56E2;&#x961F;&#x4EA4;&#x6D41;&#x8FBE;&#x6210;&#x5171;&#x8BC6;&#x7684;&#xFF0C;&#x80FD;&#x591F;&#x7B80;&#x5355;&#x3001;&#x6E05;&#x6670;&#x3001;&#x51C6;&#x786E;&#x63CF;&#x8FF0;&#x4E1A;&#x52A1;&#x6DB5;&#x4E49;&#x548C;&#x89C4;&#x5219;&#x7684;&#x8BED;&#x8A00;&#x5C31;&#x662F;&#x901A;&#x7528;&#x8BED;&#x8A00;&#x3002;</p>
<p><img src="../images/image-20220404153242122.png" alt="image-20220404153242122"></p>
<ol>
<li>&#x5728;&#x4E8B;&#x4EF6;&#x98CE;&#x66B4;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x9886;&#x57DF;&#x4E13;&#x5BB6;&#x4F1A;&#x548C;&#x8BBE;&#x8BA1;&#x3001;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E00;&#x8D77;&#x5EFA;&#x7ACB;&#x9886;&#x57DF;&#x6A21;&#x578B;&#xFF0C;&#x5728;&#x9886;&#x57DF;&#x5EFA;&#x6A21;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F1A;&#x5F62;&#x6210;&#x901A;&#x7528;&#x7684;&#x4E1A;&#x52A1;&#x672F;&#x8BED;&#x548C;&#x7528;&#x6237;&#x6545;&#x4E8B;&#x3002;&#x4E8B;&#x4EF6;&#x98CE;&#x66B4;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x56E2;&#x961F;&#x7EDF;&#x4E00;&#x8BED;&#x8A00;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</li>
<li>&#x901A;&#x8FC7;&#x7528;&#x6237;&#x6545;&#x4E8B;&#x5206;&#x6790;&#x4F1A;&#x5F62;&#x6210;&#x4E00;&#x4E2A;&#x4E2A;&#x7684;&#x9886;&#x57DF;&#x5BF9;&#x8C61;&#xFF0C;&#x8FD9;&#x4E9B;&#x9886;&#x57DF;&#x5BF9;&#x8C61;&#x5BF9;&#x5E94;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x7684;&#x4E1A;&#x52A1;&#x5BF9;&#x8C61;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x4E1A;&#x52A1;&#x5BF9;&#x8C61;&#x548C;&#x9886;&#x57DF;&#x5BF9;&#x8C61;&#x90FD;&#x6709;&#x901A;&#x7528;&#x7684;&#x540D;&#x8BCD;&#x672F;&#x8BED;&#xFF0C;&#x5E76;&#x4E14;&#x4E00;&#x4E00;&#x6620;&#x5C04;&#x3002;</li>
<li>&#x5FAE;&#x670D;&#x52A1;&#x4EE3;&#x7801;&#x6A21;&#x578B;&#x6765;&#x6E90;&#x4E8E;&#x9886;&#x57DF;&#x6A21;&#x578B;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EE3;&#x7801;&#x6A21;&#x578B;&#x7684;&#x4EE3;&#x7801;&#x5BF9;&#x8C61;&#x8DDF;&#x9886;&#x57DF;&#x5BF9;&#x8C61;&#x4E00;&#x4E00;&#x5BF9;&#x5E94;&#x3002;</li>
</ol>
<h3 id="&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;">&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;</h3>
<p>&#x200B;        &#x786E;&#x5B9A;&#x8BED;&#x4E49;&#x6240;&#x5728;&#x7684;&#x9886;&#x57DF;&#x8FB9;&#x754C;&#x3002;&#x7528;&#x6765;&#x5C01;&#x88C5;&#x901A;&#x7528;&#x8BED;&#x8A00;&#x548C;&#x9886;&#x57DF;&#x5BF9;&#x8C61;&#xFF0C;&#x63D0;&#x4F9B;&#x4E0A;&#x4E0B;&#x6587;&#x73AF;&#x5883;&#xFF0C;&#x4FDD;&#x8BC1;&#x5728;&#x9886;&#x57DF;&#x4E4B;&#x5185;&#x7684;&#x4E00;&#x4E9B;&#x672F;&#x8BED;&#x3001;&#x4E1A;&#x52A1;&#x76F8;&#x5173;&#x5BF9;&#x8C61;&#x7B49;&#xFF08;&#x901A;&#x7528;&#x8BED;&#x8A00;&#xFF09;&#x6709;&#x4E00;&#x4E2A;&#x786E;&#x5207;&#x7684;&#x542B;&#x4E49;&#xFF0C;&#x6CA1;&#x6709;&#x4E8C;&#x4E49;&#x6027;&#x3002;</p>
<p>&#x200B;        &#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x786E;&#x5B9A;&#x4E86;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x8BBE;&#x8BA1;&#x548C;&#x62C6;&#x5206;&#x65B9;&#x5411;&#xFF0C;&#x662F;&#x5FAE;&#x670D;&#x52A1;&#x8BBE;&#x8BA1;&#x548C;&#x62C6;&#x5206;&#x7684;&#x4E3B;&#x8981;&#x4F9D;&#x636E;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x8003;&#x8651;&#x6280;&#x672F;&#x5F02;&#x6784;&#x3001;&#x56E2;&#x961F;&#x6C9F;&#x901A;&#x7B49;&#x5176;&#x5B83;&#x5916;&#x90E8;&#x56E0;&#x7D20;&#xFF0C;&#x4E00;&#x4E2A;&#x9650;&#x754C;&#x4E0A;&#x4E0B;&#x6587;&#x7406;&#x8BBA;&#x4E0A;&#x5C31;&#x53EF;&#x4EE5;&#x8BBE;&#x8BA1;&#x4E3A;&#x4E00;&#x4E2A;&#x5FAE;&#x670D;&#x52A1;&#x3002;</p>
<h2 id="&#x5B9E;&#x4F53;&#x548C;&#x503C;&#x5BF9;&#x8C61;">&#x5B9E;&#x4F53;&#x548C;&#x503C;&#x5BF9;&#x8C61;</h2>
<p>&#x5B9E;&#x4F53;&#x548C;&#x503C;&#x5BF9;&#x8C61;&#x662F;&#x5FAE;&#x670D;&#x52A1;&#x5E95;&#x5C42;&#x7684;&#x6700;&#x57FA;&#x7840;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x4E00;&#x8D77;&#x5B9E;&#x73B0;&#x5B9E;&#x4F53;&#x6700;&#x57FA;&#x672C;&#x7684;&#x6838;&#x5FC3;&#x9886;&#x57DF;&#x903B;&#x8F91;&#x3002;</p>
<p>DDD &#x63D0;&#x5021;&#x4ECE;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x8BBE;&#x8BA1;&#x51FA;&#x53D1;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5148;&#x8BBE;&#x8BA1;&#x6570;&#x636E;&#x6A21;&#x578B;&#x3002;</p>
<p><img src="../images/image-20220404155853636.png" alt="image-20220404155853636">        &#x5728;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x4E2D;&#x4EBA;&#x5458;&#x662F;&#x5B9E;&#x4F53;&#xFF0C;&#x5730;&#x5740;&#x662F;&#x503C;&#x5BF9;&#x8C61;&#xFF0C;&#x5730;&#x5740;&#x503C;&#x5BF9;&#x8C61;&#x88AB;&#x4EBA;&#x5458;&#x5B9E;&#x4F53;&#x5F15;&#x7528;&#x3002;&#x5728;&#x6570;&#x636E;&#x6A21;&#x578B;&#x8BBE;&#x8BA1;&#x65F6;&#xFF0C;&#x5730;&#x5740;&#x503C;&#x5BF9;&#x8C61;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;&#x96C6;&#x6574;&#x4F53;&#x5D4C;&#x5165;&#x4EBA;&#x5458;&#x5B9E;&#x4F53;&#x4E2D;&#xFF0C;&#x7EC4;&#x5408;&#x5F62;&#x6210;&#x4E0A;&#x56FE;&#x8FD9;&#x6837;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#xFF1B;&#x4E5F;&#x53EF;&#x4EE5;&#x4EE5;&#x5E8F;&#x5217;&#x5316;&#x5927;&#x5BF9;&#x8C61;&#x7684;&#x5F62;&#x5F0F;&#x52A0;&#x5165;&#x5230;&#x4EBA;&#x5458;&#x7684;&#x5730;&#x5740;&#x5C5E;&#x6027;&#x4E2D;&#xFF0C;&#x524D;&#x9762;&#x8868;&#x683C;&#x6709;&#x5C55;&#x793A;&#x3002;</p>
<h2 id="&#x805A;&#x5408;&#x4E0E;&#x805A;&#x5408;&#x6839;">&#x805A;&#x5408;&#x4E0E;&#x805A;&#x5408;&#x6839;</h2>
<ul>
<li>&#x805A;&#x5408;&#xFF1A;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x5185;&#x7684;&#x5B9E;&#x4F53;&#x548C;&#x503C;&#x5BF9;&#x8C61;&#x5C31;&#x597D;&#x6BD4;&#x4E2A;&#x4F53;&#xFF0C;&#x800C;&#x80FD;&#x8BA9;&#x5B9E;&#x4F53;&#x548C;&#x503C;&#x5BF9;&#x8C61;&#x534F;&#x540C;&#x5DE5;&#x4F5C;&#x7684;&#x7EC4;&#x7EC7;&#x5C31;&#x662F;&#x805A;&#x5408;&#xFF0C;&#x5B83;&#x7528;&#x6765;&#x786E;&#x4FDD;&#x8FD9;&#x4E9B;&#x9886;&#x57DF;&#x5BF9;&#x8C61;&#x5728;&#x5B9E;&#x73B0;&#x5171;&#x540C;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x65F6;&#xFF0C;&#x80FD;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x3002;</li>
<li>&#x805A;&#x5408;&#x6839;&#xFF1A;&#x5982;&#x679C;&#x628A;&#x805A;&#x5408;&#x6BD4;&#x4F5C;&#x7EC4;&#x7EC7;&#xFF0C;&#x90A3;&#x805A;&#x5408;&#x6839;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x7EC4;&#x7EC7;&#x7684;&#x8D1F;&#x8D23;&#x4EBA;&#x3002;&#x805A;&#x5408;&#x6839;&#x4E5F;&#x79F0;&#x4E3A;&#x6839;&#x5B9E;&#x4F53;&#xFF0C;&#x5B83;&#x4E0D;&#x4EC5;&#x662F;&#x5B9E;&#x4F53;&#xFF0C;&#x8FD8;&#x662F;&#x805A;&#x5408;&#x7684;&#x7BA1;&#x7406;&#x8005;&#x3002;</li>
</ul>
<p><img src="../images/image-20220404194356547.png" alt="image-20220404194356547"></p>
<p>&#x805A;&#x5408;&#x7684;&#x7279;&#x70B9;&#xFF1A;&#x9AD8;&#x5185;&#x805A;&#x3001;&#x4F4E;&#x8026;&#x5408;&#xFF0C;&#x5B83;&#x662F;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x4E2D;&#x6700;&#x5E95;&#x5C42;&#x7684;&#x8FB9;&#x754C;&#xFF0C;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x62C6;&#x5206;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x6700;&#x5C0F;&#x5355;&#x4F4D;&#xFF0C;&#x4F46;&#x6211;&#x4E0D;&#x5EFA;&#x8BAE;&#x4F60;&#x5BF9;&#x5FAE;&#x670D;&#x52A1;&#x8FC7;&#x5EA6;&#x62C6;&#x5206;&#x3002;&#x4F46;&#x5728;&#x5BF9;&#x6027;&#x80FD;&#x6709;&#x6781;&#x81F4;&#x8981;&#x6C42;&#x7684;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x805A;&#x5408;&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5FAE;&#x670D;&#x52A1;&#xFF0C;&#x4EE5;&#x6EE1;&#x8DB3;&#x7248;&#x672C;&#x7684;&#x9AD8;&#x9891;&#x53D1;&#x5E03;&#x548C;&#x6781;&#x81F4;&#x7684;&#x5F39;&#x6027;&#x4F38;&#x7F29;&#x80FD;&#x529B;&#x3002;&#x4E00;&#x4E2A;&#x5FAE;&#x670D;&#x52A1;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x591A;&#x4E2A;&#x805A;&#x5408;&#xFF0C;&#x805A;&#x5408;&#x4E4B;&#x95F4;&#x7684;&#x8FB9;&#x754C;&#x662F;&#x5FAE;&#x670D;&#x52A1;&#x5185;&#x5929;&#x7136;&#x7684;&#x903B;&#x8F91;&#x8FB9;&#x754C;&#x3002;&#x6709;&#x4E86;&#x8FD9;&#x4E2A;&#x903B;&#x8F91;&#x8FB9;&#x754C;&#xFF0C;&#x5728;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x6F14;&#x8FDB;&#x65F6;&#x5C31;&#x53EF;&#x4EE5;&#x4EE5;&#x805A;&#x5408;&#x4E3A;&#x5355;&#x4F4D;&#x8FDB;&#x884C;&#x62C6;&#x5206;&#x548C;&#x7EC4;&#x5408;&#x4E86;&#xFF0C;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x67B6;&#x6784;&#x6F14;&#x8FDB;&#x4E5F;&#x5C31;&#x4E0D;&#x518D;&#x662F;&#x4E00;&#x4EF6;&#x96BE;&#x4E8B;&#x4E86;&#x3002;</p>
<p>&#x805A;&#x5408;&#x6839;&#x7684;&#x7279;&#x70B9;&#xFF1A;&#x805A;&#x5408;&#x6839;&#x662F;&#x5B9E;&#x4F53;&#xFF0C;&#x6709;&#x5B9E;&#x4F53;&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x5177;&#x6709;&#x5168;&#x5C40;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#xFF0C;&#x6709;&#x72EC;&#x7ACB;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x3002;&#x4E00;&#x4E2A;&#x805A;&#x5408;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x805A;&#x5408;&#x6839;&#xFF0C;&#x805A;&#x5408;&#x6839;&#x5728;&#x805A;&#x5408;&#x5185;&#x5BF9;&#x5B9E;&#x4F53;&#x548C;&#x503C;&#x5BF9;&#x8C61;&#x91C7;&#x7528;&#x76F4;&#x63A5;&#x5BF9;&#x8C61;&#x5F15;&#x7528;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x7EC4;&#x7EC7;&#x548C;&#x534F;&#x8C03;&#xFF0C;&#x805A;&#x5408;&#x6839;&#x4E0E;&#x805A;&#x5408;&#x6839;&#x4E4B;&#x95F4;&#x901A;&#x8FC7; ID &#x5173;&#x8054;&#x7684;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x805A;&#x5408;&#x4E4B;&#x95F4;&#x7684;&#x534F;&#x540C;&#x3002;</p>
<p>&#x5B9E;&#x4F53;&#x7684;&#x7279;&#x70B9;&#xFF1A;&#x6709; ID &#x6807;&#x8BC6;&#xFF0C;&#x901A;&#x8FC7; ID &#x5224;&#x65AD;&#x76F8;&#x7B49;&#x6027;&#xFF0C;ID &#x5728;&#x805A;&#x5408;&#x5185;&#x552F;&#x4E00;&#x5373;&#x53EF;&#x3002;&#x72B6;&#x6001;&#x53EF;&#x53D8;&#xFF0C;&#x5B83;&#x4F9D;&#x9644;&#x4E8E;&#x805A;&#x5408;&#x6839;&#xFF0C;&#x5176;&#x751F;&#x547D;&#x5468;&#x671F;&#x7531;&#x805A;&#x5408;&#x6839;&#x7BA1;&#x7406;&#x3002;&#x5B9E;&#x4F53;&#x4E00;&#x822C;&#x4F1A;&#x6301;&#x4E45;&#x5316;&#xFF0C;&#x4F46;&#x4E0E;&#x6570;&#x636E;&#x5E93;&#x6301;&#x4E45;&#x5316;&#x5BF9;&#x8C61;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x4E00;&#x5BF9;&#x4E00;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x5B9E;&#x4F53;&#x53EF;&#x4EE5;&#x5F15;&#x7528;&#x805A;&#x5408;&#x5185;&#x7684;&#x805A;&#x5408;&#x6839;&#x3001;&#x5B9E;&#x4F53;&#x548C;&#x503C;&#x5BF9;&#x8C61;&#x3002;</p>
<p>&#x503C;&#x5BF9;&#x8C61;&#x7684;&#x7279;&#x70B9;&#xFF1A;&#x65E0; ID&#xFF0C;&#x4E0D;&#x53EF;&#x53D8;&#xFF0C;&#x65E0;&#x751F;&#x547D;&#x5468;&#x671F;&#xFF0C;&#x7528;&#x5B8C;&#x5373;&#x6254;&#x3002;&#x503C;&#x5BF9;&#x8C61;&#x4E4B;&#x95F4;&#x901A;&#x8FC7;&#x5C5E;&#x6027;&#x503C;&#x5224;&#x65AD;&#x76F8;&#x7B49;&#x6027;&#x3002;&#x5B83;&#x7684;&#x6838;&#x5FC3;&#x672C;&#x8D28;&#x662F;&#x503C;&#xFF0C;&#x662F;&#x4E00;&#x7EC4;&#x6982;&#x5FF5;&#x5B8C;&#x6574;&#x7684;&#x5C5E;&#x6027;&#x7EC4;&#x6210;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x7528;&#x4E8E;&#x63CF;&#x8FF0;&#x5B9E;&#x4F53;&#x7684;&#x72B6;&#x6001;&#x548C;&#x7279;&#x5F81;&#x3002;&#x503C;&#x5BF9;&#x8C61;&#x5C3D;&#x91CF;&#x53EA;&#x5F15;&#x7528;&#x503C;&#x5BF9;&#x8C61;&#x3002;</p>
<h2 id="&#x9886;&#x57DF;&#x4E8B;&#x4EF6;">&#x9886;&#x57DF;&#x4E8B;&#x4EF6;</h2>
<p>&#x9886;&#x57DF;&#x4E8B;&#x4EF6;&#x662F;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x4E2D;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x7528;&#x6765;&#x8868;&#x793A;&#x9886;&#x57DF;&#x4E2D;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x4EF6;&#x3002;&#x4E00;&#x4E2A;&#x9886;&#x57DF;&#x4E8B;&#x4EF6;&#x5C06;&#x5BFC;&#x81F4;&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x4E1A;&#x52A1;&#x64CD;&#x4F5C;&#xFF0C;&#x5728;&#x5B9E;&#x73B0;&#x4E1A;&#x52A1;&#x89E3;&#x8026;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x8FD8;&#x6709;&#x52A9;&#x4E8E;&#x5F62;&#x6210;&#x5B8C;&#x6574;&#x7684;&#x4E1A;&#x52A1;&#x95ED;&#x73AF;&#x3002;</p>
<h2 id="&#x6709;&#x6548;&#x964D;&#x4F4E;&#x5C42;&#x4E0E;&#x5C42;&#x4E4B;&#x95F4;&#x7684;&#x4F9D;&#x8D56;">&#x6709;&#x6548;&#x964D;&#x4F4E;&#x5C42;&#x4E0E;&#x5C42;&#x4E4B;&#x95F4;&#x7684;&#x4F9D;&#x8D56;</h2>
<p><img src="../images/image-20220404204456213.png" alt="image-20220404204456213"></p>
<ol>
<li>&#x7528;&#x6237;&#x63A5;&#x53E3;&#x5C42;&#xFF1A;&#x7528;&#x6237;&#x63A5;&#x53E3;&#x5C42;&#x8D1F;&#x8D23;&#x5411;&#x7528;&#x6237;&#x663E;&#x793A;&#x4FE1;&#x606F;&#x548C;&#x89E3;&#x91CA;&#x7528;&#x6237;&#x6307;&#x4EE4;&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x7528;&#x6237;&#x53EF;&#x80FD;&#x662F;&#xFF1A;&#x7528;&#x6237;&#x3001;&#x7A0B;&#x5E8F;&#x3001;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x548C;&#x6279;&#x5904;&#x7406;&#x811A;&#x672C;&#x7B49;&#x7B49;&#x3002;</li>
<li>&#x5E94;&#x7528;&#x5C42;&#xFF1A;&#x5E94;&#x7528;&#x5C42;&#x662F;&#x5F88;&#x8584;&#x7684;&#x4E00;&#x5C42;&#xFF0C;&#x7406;&#x8BBA;&#x4E0A;&#x4E0D;&#x5E94;&#x8BE5;&#x6709;&#x4E1A;&#x52A1;&#x89C4;&#x5219;&#x6216;&#x903B;&#x8F91;&#xFF0C;&#x4E3B;&#x8981;&#x9762;&#x5411;&#x7528;&#x4F8B;&#x548C;&#x6D41;&#x7A0B;&#x76F8;&#x5173;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x4F46;&#x5E94;&#x7528;&#x5C42;&#x53C8;&#x4F4D;&#x4E8E;&#x9886;&#x57DF;&#x5C42;&#x4E4B;&#x4E0A;&#xFF0C;&#x56E0;&#x4E3A;&#x9886;&#x57DF;&#x5C42;&#x5305;&#x542B;&#x591A;&#x4E2A;&#x805A;&#x5408;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x53EF;&#x4EE5;&#x534F;&#x8C03;&#x591A;&#x4E2A;&#x805A;&#x5408;&#x7684;&#x670D;&#x52A1;&#x548C;&#x9886;&#x57DF;&#x5BF9;&#x8C61;&#x5B8C;&#x6210;&#x670D;&#x52A1;&#x7F16;&#x6392;&#x548C;&#x7EC4;&#x5408;&#xFF0C;&#x534F;&#x4F5C;&#x5B8C;&#x6210;&#x4E1A;&#x52A1;&#x64CD;&#x4F5C;&#x3002;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x662F;&#x5728;&#x5E94;&#x7528;&#x5C42;&#x7684;&#xFF0C;&#x5B83;&#x8D1F;&#x8D23;&#x670D;&#x52A1;&#x7684;&#x7EC4;&#x5408;&#x3001;&#x7F16;&#x6392;&#x548C;&#x8F6C;&#x53D1;&#xFF0C;&#x8D1F;&#x8D23;&#x5904;&#x7406;&#x4E1A;&#x52A1;&#x7528;&#x4F8B;&#x7684;&#x6267;&#x884C;&#x987A;&#x5E8F;&#x4EE5;&#x53CA;&#x7ED3;&#x679C;&#x7684;&#x62FC;&#x88C5;&#xFF0C;&#x4EE5;&#x7C97;&#x7C92;&#x5EA6;&#x7684;&#x670D;&#x52A1;&#x901A;&#x8FC7; API &#x7F51;&#x5173;&#x5411;&#x524D;&#x7AEF;&#x53D1;&#x5E03;&#x3002;&#x8FD8;&#x6709;&#xFF0C;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x8FD8;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x5B89;&#x5168;&#x8BA4;&#x8BC1;&#x3001;&#x6743;&#x9650;&#x6821;&#x9A8C;&#x3001;&#x4E8B;&#x52A1;&#x63A7;&#x5236;&#x3001;&#x53D1;&#x9001;&#x6216;&#x8BA2;&#x9605;&#x9886;&#x57DF;&#x4E8B;&#x4EF6;&#x7B49;&#x3002;</li>
<li>&#x9886;&#x57DF;&#x5C42;&#xFF1A;&#x9886;&#x57DF;&#x5C42;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x5B9E;&#x73B0;&#x4F01;&#x4E1A;&#x6838;&#x5FC3;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#xFF0C;&#x901A;&#x8FC7;&#x5404;&#x79CD;&#x6821;&#x9A8C;&#x624B;&#x6BB5;&#x4FDD;&#x8BC1;&#x4E1A;&#x52A1;&#x7684;&#x6B63;&#x786E;&#x6027;&#x3002;&#x9886;&#x57DF;&#x5C42;&#x4E3B;&#x8981;&#x4F53;&#x73B0;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x7684;&#x4E1A;&#x52A1;&#x80FD;&#x529B;&#xFF0C;&#x5B83;&#x7528;&#x6765;&#x8868;&#x8FBE;&#x4E1A;&#x52A1;&#x6982;&#x5FF5;&#x3001;&#x4E1A;&#x52A1;&#x72B6;&#x6001;&#x548C;&#x4E1A;&#x52A1;&#x89C4;&#x5219;&#x3002;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x4E3B;&#x8981;&#x662F;&#x7531;&#x5B9E;&#x4F53;&#x548C;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x6765;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x5176;&#x4E2D;&#x5B9E;&#x4F53;&#x4F1A;&#x91C7;&#x7528;&#x5145;&#x8840;&#x6A21;&#x578B;&#x6765;&#x5B9E;&#x73B0;&#x6240;&#x6709;&#x4E0E;&#x4E4B;&#x76F8;&#x5173;&#x7684;&#x4E1A;&#x52A1;&#x529F;&#x80FD;&#x3002;&#x5176;&#x6B21;&#xFF0C;&#x4F60;&#x8981;&#x77E5;&#x9053;&#xFF0C;&#x5B9E;&#x4F53;&#x548C;&#x9886;&#x57DF;&#x5BF9;&#x8C61;&#x5728;&#x5B9E;&#x73B0;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x4E0A;&#x4E0D;&#x662F;&#x540C;&#x7EA7;&#x7684;&#xFF0C;&#x5F53;&#x9886;&#x57DF;&#x4E2D;&#x7684;&#x67D0;&#x4E9B;&#x529F;&#x80FD;&#xFF0C;&#x5355;&#x4E00;&#x5B9E;&#x4F53;&#xFF08;&#x6216;&#x8005;&#x503C;&#x5BF9;&#x8C61;&#xFF09;&#x4E0D;&#x80FD;&#x5B9E;&#x73B0;&#x65F6;&#xFF0C;&#x9886;&#x57DF;&#x670D;&#x52A1;&#x5C31;&#x4F1A;&#x51FA;&#x9A6C;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x7EC4;&#x5408;&#x805A;&#x5408;&#x5185;&#x7684;&#x591A;&#x4E2A;&#x5B9E;&#x4F53;&#xFF08;&#x6216;&#x8005;&#x503C;&#x5BF9;&#x8C61;&#xFF09;&#xFF0C;&#x5B9E;&#x73B0;&#x590D;&#x6742;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x3002;</li>
<li>&#x57FA;&#x7840;&#x5C42;&#xFF1A;&#x57FA;&#x7840;&#x5C42;&#x662F;&#x8D2F;&#x7A7F;&#x6240;&#x6709;&#x5C42;&#x7684;&#xFF0C;&#x5B83;&#x7684;&#x4F5C;&#x7528;&#x5C31;&#x662F;&#x4E3A;&#x5176;&#x5B83;&#x5404;&#x5C42;&#x63D0;&#x4F9B;&#x901A;&#x7528;&#x7684;&#x6280;&#x672F;&#x548C;&#x57FA;&#x7840;&#x670D;&#x52A1;&#xFF0C;&#x5305;&#x62EC;&#x7B2C;&#x4E09;&#x65B9;&#x5DE5;&#x5177;&#x3001;&#x9A71;&#x52A8;&#x3001;&#x6D88;&#x606F;&#x4E2D;&#x95F4;&#x4EF6;&#x3001;&#x7F51;&#x5173;&#x3001;&#x6587;&#x4EF6;&#x3001;&#x7F13;&#x5B58;&#x4EE5;&#x53CA;&#x6570;&#x636E;&#x5E93;&#x7B49;&#x3002;&#x6BD4;&#x8F83;&#x5E38;&#x89C1;&#x7684;&#x529F;&#x80FD;&#x8FD8;&#x662F;&#x63D0;&#x4F9B;&#x6570;&#x636E;&#x5E93;&#x6301;&#x4E45;&#x5316;&#x3002;</li>
</ol>
<p><code>&#x6BCF;&#x5C42;&#x53EA;&#x80FD;&#x4E0E;&#x4F4D;&#x4E8E;&#x5176;&#x4E0B;&#x65B9;&#x7684;&#x5C42;&#x53D1;&#x751F;&#x8026;&#x5408;&#x3002;</code></p>
<h3 id="3&#x5C42;&#x67B6;&#x6784;&#x6F14;&#x8FDB;ddd&#x5206;&#x5C42;&#x67B6;&#x6784;">3&#x5C42;&#x67B6;&#x6784;&#x6F14;&#x8FDB;DDD&#x5206;&#x5C42;&#x67B6;&#x6784;</h3>
<p><img src="../images/image-20220404205616435.png" alt="image-20220404205616435"></p>
<h2 id="3&#x79CD;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x5BF9;&#x6BD4;">3&#x79CD;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x5BF9;&#x6BD4;</h2>
<p><img src="../images/image-20220404210213467.png" alt="image-20220404210213467"></p>
<p>&#x4E2D;&#x53F0;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x9886;&#x57DF;&#x7684;&#x5B50;&#x57DF;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x662F;&#x6838;&#x5FC3;&#x57DF;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x901A;&#x7528;&#x57DF;&#x6216;&#x652F;&#x6491;&#x57DF;&#x3002;&#x901A;&#x5E38;&#x5927;&#x5BB6;&#x8BA4;&#x4E3A;&#x963F;&#x91CC;&#x7684;&#x4E2D;&#x53F0;&#x5BF9;&#x5E94; DDD &#x7684;&#x901A;&#x7528;&#x57DF;&#xFF0C;&#x5C06;&#x901A;&#x7528;&#x7684;&#x516C;&#x5171;&#x80FD;&#x529B;&#x6C89;&#x6DC0;&#x4E3A;&#x4E2D;&#x53F0;&#xFF0C;&#x5BF9;&#x5916;&#x63D0;&#x4F9B;&#x901A;&#x7528;&#x5171;&#x4EAB;&#x670D;&#x52A1;&#x3002;</p>
<h2 id="&#x4E2D;&#x53F0;">&#x4E2D;&#x53F0;</h2>
<p>&#x4E2D;&#x53F0;&#x6765;&#x6E90;&#x4E8E;&#x5E73;&#x53F0;&#xFF0C;&#x4F46;&#x4E2D;&#x53F0;&#x548C;&#x5E73;&#x53F0;&#x76F8;&#x6BD4;&#xFF0C;&#x5B83;&#x66F4;&#x591A;&#x4F53;&#x73B0;&#x7684;&#x662F;&#x4E00;&#x79CD;&#x7406;&#x5FF5;&#x7684;&#x8F6C;&#x53D8;&#xFF0C;&#x5B83;&#x4E3B;&#x8981;&#x4F53;&#x73B0;&#x5728;&#x8FD9;&#x4E09;&#x4E2A;&#x5173;&#x952E;&#x80FD;&#x529B;&#x4E0A;&#xFF1A;&#x5BF9;&#x524D;&#x53F0;&#x4E1A;&#x52A1;&#x7684;&#x5FEB;&#x901F;&#x54CD;&#x5E94;&#x80FD;&#x529B;&#xFF1B;&#x4F01;&#x4E1A;&#x7EA7;&#x590D;&#x7528;&#x80FD;&#x529B;&#xFF1B;&#x4ECE;&#x524D;&#x53F0;&#x3001;&#x4E2D;&#x53F0;&#x5230;&#x540E;&#x53F0;&#x7684;&#x8BBE;&#x8BA1;&#x3001;&#x7814;&#x53D1;&#x3001;&#x9875;&#x9762;&#x64CD;&#x4F5C;&#x3001;&#x6D41;&#x7A0B;&#x670D;&#x52A1;&#x548C;&#x6570;&#x636E;&#x7684;&#x65E0;&#x7F1D;&#x8054;&#x901A;&#x3001;&#x878D;&#x5408;&#x80FD;&#x529B;&#x3002;</p>
<p>&#x4E2D;&#x53F0;&#x7684;&#x672C;&#x8D28;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x63D0;&#x70BC;&#x5404;&#x4E2A;&#x4E1A;&#x52A1;&#x677F;&#x5757;&#x7684;&#x5171;&#x540C;&#x9700;&#x6C42;&#xFF0C;&#x8FDB;&#x884C;&#x4E1A;&#x52A1;&#x548C;&#x7CFB;&#x7EDF;&#x62BD;&#x8C61;&#xFF0C;&#x5F62;&#x6210;&#x901A;&#x7528;&#x7684;&#x53EF;&#x590D;&#x7528;&#x7684;&#x4E1A;&#x52A1;&#x6A21;&#x578B;&#xFF0C;&#x6253;&#x9020;&#x6210;&#x7EC4;&#x4EF6;&#x5316;&#x4EA7;&#x54C1;&#xFF0C;&#x4F9B;&#x524D;&#x53F0;&#x90E8;&#x95E8;&#x4F7F;&#x7528;&#x3002;&#x524D;&#x53F0;&#x8981;&#x505A;&#x4EC0;&#x4E48;&#x4E1A;&#x52A1;&#xFF0C;&#x9700;&#x8981;&#x4EC0;&#x4E48;&#x8D44;&#x6E90;&#xFF0C;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x627E;&#x4E2D;&#x53F0;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x6BCF;&#x6B21;&#x90FD;&#x53BB;&#x6539;&#x52A8;&#x81EA;&#x5DF1;&#x7684;&#x5E95;&#x5C42;&#x3002;</p>
<p>&#x6570;&#x636E;&#x4E2D;&#x53F0;&#x7684;&#x4E3B;&#x8981;&#x76EE;&#x6807;&#x662F;&#x6253;&#x901A;&#x6570;&#x636E;&#x5B64;&#x5C9B;&#xFF0C;&#x5B9E;&#x73B0;&#x4E1A;&#x52A1;&#x878D;&#x5408;&#x548C;&#x521B;&#x65B0;&#xFF0C;&#x5305;&#x62EC;&#x4E09;&#x5927;&#x4E3B;&#x8981;&#x804C;&#x80FD;&#xFF1A;</p>
<ul>
<li>&#x5B8C;&#x6210;&#x4F01;&#x4E1A;&#x5168;&#x57DF;&#x6570;&#x636E;&#x7684;&#x91C7;&#x96C6;&#x4E0E;&#x5B58;&#x50A8;&#xFF0C;&#x5B9E;&#x73B0;&#x5404;&#x4E0D;&#x540C;&#x4E1A;&#x52A1;&#x7C7B;&#x522B;&#x4E2D;&#x53F0;&#x6570;&#x636E;&#x7684;&#x6C47;&#x603B;&#x548C;&#x96C6;&#x4E2D;&#x7BA1;&#x7406;&#x3002;</li>
<li>&#x6309;&#x7167;&#x6807;&#x51C6;&#x7684;&#x6570;&#x636E;&#x89C4;&#x8303;&#x6216;&#x6570;&#x636E;&#x6A21;&#x578B;&#xFF0C;&#x5C06;&#x6570;&#x636E;&#x6309;&#x7167;&#x4E0D;&#x540C;&#x4E3B;&#x9898;&#x57DF;&#x6216;&#x573A;&#x666F;&#x8FDB;&#x884C;&#x52A0;&#x5DE5;&#x548C;&#x5904;&#x7406;&#xFF0C;&#x5F62;&#x6210;&#x9762;&#x5411;&#x4E0D;&#x540C;&#x4E3B;&#x9898;&#x548C;</li>
<li>&#x5EFA;&#x7ACB;&#x4E1A;&#x52A1;&#x9700;&#x6C42;&#x9A71;&#x52A8;&#x7684;&#x6570;&#x636E;&#x4F53;&#x7CFB;&#xFF0C;&#x57FA;&#x4E8E;&#x5404;&#x4E2A;&#x7EF4;&#x5EA6;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6DF1;&#x5EA6;&#x8403;&#x53D6;&#x6570;&#x636E;&#x4EF7;&#x503C;&#xFF0C;&#x652F;&#x6301;&#x4E1A;&#x52A1;&#x548C;&#x5546;&#x4E1A;&#x6A21;&#x5F0F;&#x7684;&#x521B;&#x65B0;&#x3002;</li>
</ul>
<p>&#x524D;&#x53F0;&#x4E3B;&#x8981;&#x9762;&#x5411;&#x5BA2;&#x6237;&#x4EE5;&#x53CA;&#x7EC8;&#x7AEF;&#x9500;&#x552E;&#x8005;&#xFF0C;&#x5B9E;&#x73B0;&#x8425;&#x9500;&#x63A8;&#x5E7F;&#x4EE5;&#x53CA;&#x4EA4;&#x6613;&#x8F6C;&#x5316;&#xFF1B;&#x4E2D;&#x53F0;&#x4E3B;&#x8981;&#x9762;&#x5411;&#x8FD0;&#x8425;&#x4EBA;&#x5458;&#xFF0C;&#x5B8C;&#x6210;&#x8FD0;&#x8425;&#x652F;&#x6491;&#xFF1B;&#x540E;&#x53F0;&#x4E3B;&#x8981;&#x9762;&#x5411;&#x540E;&#x53F0;&#x7BA1;&#x7406;&#x4EBA;&#x5458;&#xFF0C;&#x5B9E;&#x73B0;&#x6D41;&#x7A0B;&#x5BA1;&#x6838;&#x3001;&#x5185;&#x90E8;&#x7BA1;&#x7406;&#x4EE5;&#x53CA;&#x540E;&#x52E4;&#x652F;&#x6491;&#xFF0C;&#x6BD4;&#x5982;&#x91C7;&#x8D2D;&#x3001;&#x4EBA;&#x529B;&#x3001;&#x8D22;&#x52A1;&#x548C; OA &#x7B49;&#x7CFB;&#x7EDF;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../系统性能调优/1.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 系统性能调优">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"DDD","level":"1.8","depth":1,"previous":{"title":"系统性能调优","level":"1.7","depth":1,"path":"系统性能调优/1.md","ref":"系统性能调优/1.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["-lunr","-search","search-pro","back-to-top-button","expandable-chapters-small","page-toc-button","theme-comscore"],"pluginsConfig":{"search-pro":{},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"theme-comscore":{},"page-toc-button":{"maxTocDepth":2,"minTocSize":2},"back-to-top-button":{},"expandable-chapters-small":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"DDD/1.md","mtime":"2022-04-04T13:33:29.782Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-04-21T17:29:42.416Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-theme-comscore/test.js"></script>
        
    

    </body>
</html>

